exp 6 vector addition

exp 1 Data Preprocessing

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("data.csv")

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [5]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [6]:
newdata = data.dropna()

In [7]:
newdata.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [8]:
# null_row = ['Age','Salary']
# for i in null_row:
#   mean = data[i].mean()
#   data[i].fillna(value = mean,inplace=True)
# data.isnull().sum()

In [8]:
age_mean = data['Age'].mean()
#data['Age'].fillna(value = age_mean, inplace=True)
data.fillna(value={'Age': age_mean}, inplace=True)
data

   Country        Age   Salary Purchased
0   France  44.000000  72000.0        No
1    Spain  27.000000  48000.0       Yes
2  Germany  30.000000  54000.0        No
3    Spain  38.000000  61000.0        No
4  Germany  40.000000      NaN       Yes
5   France  35.000000  58000.0       Yes
6    Spain  38.777778  52000.0        No
7   France  48.000000  79000.0       Yes
8  Germany  50.000000  83000.0        No
9   France  37.000000  67000.0       Yes

In [9]:
data.isnull().sum()

Country      0
Age          0
Salary       1
Purchased    0
dtype: int64

In [10]:
salary_mean = data['Salary'].mean()
#data['Salary'].fillna(value = salary_mean, inplace=True)
data.fillna(value={'Salary':salary_mean},inplace=True)
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [11]:
# Handling Categorical Data
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

data['Country'] = le.fit_transform(data['Country'])
data['Purchased'] = le.fit_transform(data['Purchased'])
data

   Country        Age        Salary  Purchased
0        0  44.000000  72000.000000          0
1        2  27.000000  48000.000000          1
2        1  30.000000  54000.000000          0
3        2  38.000000  61000.000000          0
4        1  40.000000  63777.777778          1
5        0  35.000000  58000.000000          1
6        2  38.777778  52000.000000          0
7        0  48.000000  79000.000000          1
8        1  50.000000  83000.000000          0
9        0  37.000000  67000.000000          1

In [12]:
# Feature Scaling
from sklearn.preprocessing import MinMaxScaler
mmscaler = MinMaxScaler(feature_range=(0,1))
newdata = mmscaler.fit_transform(data)
newdata = pd.DataFrame(newdata, columns = data.columns)
newdata

   Country       Age    Salary  Purchased
0      0.0  0.739130  0.685714        0.0
1      1.0  0.000000  0.000000        1.0
2      0.5  0.130435  0.171429        0.0
3      1.0  0.478261  0.371429        0.0
4      0.5  0.565217  0.450794        1.0
5      0.0  0.347826  0.285714        1.0
6      1.0  0.512077  0.114286        0.0
7      0.0  0.913043  0.885714        1.0
8      0.5  1.000000  1.000000        0.0
9      0.0  0.434783  0.542857        1.0

In [14]:
# Feature selection
from sklearn.feature_selection import SelectKBest,chi2
bestfit = SelectKBest(score_func= chi2,k=3)
x = ['Country','Age','Salary']
y = ['Purchased']
fit = bestfit.fit(newdata[x],newdata[y])
pd.DataFrame({"Columns" : x, "Scores":fit.scores_})

   Columns    Scores
0  Country  0.500000
1      Age  0.070076
2   Salary  0.007011